lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaTemperatureSensorJoinable/ZigbeeHaTemperatureSensorJoinable.ino
  ZigbeePersistentState state{};
  if (g_store.load(&state) && state.ieeeAddress == kIeeeAddress) {
    g_restoredState = state;
    g_haveRestoredState = true;
    g_channel = (state.channel >= 11U && state.channel <= 26U) ? state.channel
                                                                : kPreferredChannel;
    g_panId = (state.panId != 0U) ? state.panId : kPreferredPanId;
    g_parentShort = (state.parentShort != 0U) ? state.parentShort : kCoordinatorShort;
    g_extendedPanId = state.extendedPanId;
    g_nwkSequence = 1U;
    g_nwkSecurityFrameCounter =
        (state.nwkFrameCounter != 0U) ? state.nwkFrameCounter : 1U;
    g_lastInboundSecurityFrameCounter = state.incomingNwkFrameCounter;
    g_apsCounter = static_cast<uint8_t>(state.apsFrameCounter & 0xFFU);
    g_activeNetworkKeySequence = state.keySequence;
    if (state.keySequence != 0U) {
      memcpy(g_activeNetworkKey, state.networkKey, sizeof(g_activeNetworkKey));
      g_haveActiveNetworkKey = true;
    }
    g_securityEnabled = (state.flags & kStateFlagSecurityEnabled) != 0U;
    if ((state.flags & kStateFlagJoined) != 0U && state.nwkAddress != 0U &&
        state.nwkAddress != 0xFFFFU) {
      g_localShort = state.nwkAddress;
      g_joined = true;
    }
  }

  configureDeviceForCurrentNetwork();
  applyJoinLed();
}

void clearJoinState(bool clearStore) {
  g_joined = false;
  g_securityEnabled = false;
  g_lastInboundSecurityFrameCounter = 0U;
  clearActiveNetworkKey();
  g_channel = kPreferredChannel;
  g_panId = kPreferredPanId;
  g_localShort = kTempShort;
  g_parentShort = kCoordinatorShort;
  g_extendedPanId = 0U;
  if (clearStore) {
    memset(&g_restoredState, 0, sizeof(g_restoredState));
    g_haveRestoredState = false;
  }
  configureDeviceForCurrentNetwork();
  applyJoinLed();
  if (clearStore) {
    g_store.clear();
  } else {
    persistState();
  }
}

bool sendApsFrame(uint16_t destinationShort, uint8_t destinationEndpoint,
                  uint16_t clusterId, uint16_t profileId, uint8_t sourceEndpoint,
                  const uint8_t* payload, uint8_t payloadLength) {
  if (!g_joined) {
    return false;
  }
  const bool useSecurity = g_securityEnabled && g_haveActiveNetworkKey;

  ZigbeeApsDataFrame aps{};
  aps.frameType = ZigbeeApsFrameType::kData;
  aps.destinationEndpoint = destinationEndpoint;
  aps.clusterId = clusterId;
  aps.profileId = profileId;
  aps.sourceEndpoint = sourceEndpoint;
  aps.counter = g_apsCounter++;

  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  if (!ZigbeeCodec::buildApsDataFrame(aps, payload, payloadLength, apsFrame,
                                      &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = useSecurity;
  nwk.destinationShort = destinationShort;
  nwk.sourceShort = g_localShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (useSecurity) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    security.frameCounter = g_nwkSecurityFrameCounter++;
    security.sourceIeee = kIeeeAddress;
    security.keySequence = g_activeNetworkKeySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, g_activeNetworkKey,
                                              apsFrame, apsLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, apsFrame, apsLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, g_panId,
                                        destinationShort, g_localShort, nwkFrame,
                                        nwkLength, psdu, &psduLength, false)) {
    return false;
  }

  return g_radio.transmit(psdu, psduLength, false, 1200000UL);
}

bool sendDeviceAnnounce() {
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!g_device.buildDeviceAnnounce(g_zdoSequence++, payload, &payloadLength)) {
    return false;
  }
  return sendApsFrame(g_parentShort, 0U, kZigbeeZdoDeviceAnnounce,
                      kZigbeeProfileZdo, 0U, payload, payloadLength);
}

bool sendAttributeReport(uint16_t clusterId) {
  uint8_t zclFrame[127] = {0U};
  uint8_t zclLength = 0U;
  if (!g_device.buildAttributeReport(clusterId, g_zdoSequence++, zclFrame,
                                     &zclLength) ||
      zclLength == 0U) {
    return false;
  }
  uint64_t destinationIeee = 0U;
  uint8_t destinationEndpoint = kCoordinatorEndpoint;
  if (g_device.resolveBindingDestination(kLocalEndpoint, clusterId,
                                         &destinationIeee,
                                         &destinationEndpoint) &&
      destinationEndpoint != 0U) {
    return sendApsFrame(g_parentShort, destinationEndpoint, clusterId,
                        kZigbeeProfileHomeAutomation, kLocalEndpoint, zclFrame,
                        zclLength);
  }
  return sendApsFrame(g_parentShort, kCoordinatorEndpoint, clusterId,
                      kZigbeeProfileHomeAutomation, kLocalEndpoint, zclFrame,
                      zclLength);
}

bool handleApsCommand(const uint8_t* frame, uint8_t length) {
  uint8_t counter = 0U;
  uint8_t linkKey[16] = {0U};
  (void)ZigbeeSecurity::loadZigbeeAlliance09LinkKey(linkKey);
  ZigbeeApsSecurityHeader apsSecurity{};
  ZigbeeApsTransportKey transportKey{};
  if (ZigbeeSecurity::parseSecuredApsTransportKeyCommand(
          frame, length, linkKey, &transportKey, &apsSecurity, &counter) ||
      ZigbeeCodec::parseApsTransportKeyCommand(frame, length, &transportKey,
                                               &counter)) {
    if (!transportKey.valid ||
        transportKey.keyType != kZigbeeApsTransportKeyStandardNetworkKey ||
        transportKey.destinationIeee != kIeeeAddress ||
        transportKey.sourceIeee != kCoordinatorIeee) {
      return false;
    }
    memcpy(g_activeNetworkKey, transportKey.key, sizeof(g_activeNetworkKey));
    g_activeNetworkKeySequence = transportKey.keySequence;
    g_haveActiveNetworkKey = true;
    g_securityEnabled = true;
    g_lastInboundSecurityFrameCounter = 0U;
    persistState();
    Serial.print("transport_key seq=");
    Serial.print(g_activeNetworkKeySequence);
    Serial.print(" ctr=");
    Serial.print(counter);
    if (apsSecurity.valid) {
      Serial.print(" aps_sec_fc=");
      Serial.print(apsSecurity.frameCounter);
    }
    Serial.print("\r\n");
    (void)sendDeviceAnnounce();
    return true;
  }

  ZigbeeApsUpdateDevice updateDevice{};
  if (ZigbeeCodec::parseApsUpdateDeviceCommand(frame, length, &updateDevice,
                                               &counter)) {
    if (updateDevice.valid && updateDevice.deviceIeee == kIeeeAddress) {
      Serial.print("update_device short=0x");
      Serial.print(updateDevice.deviceShort, HEX);
      Serial.print(" status=0x");
      Serial.print(updateDevice.status, HEX);
      Serial.print("\r\n");
    }
    return true;
  }

