lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaTemperatureSensorJoinable/ZigbeeHaTemperatureSensorJoinable.ino
  return false;
}

bool activeScan(ScanResult* outResult) {
  if (outResult == nullptr) {
    return false;
  }
  memset(outResult, 0, sizeof(*outResult));

  uint8_t request[127] = {0U};
  uint8_t requestLength = 0U;
  if (!ZigbeeCodec::buildBeaconRequest(g_macSequence++, request, &requestLength)) {
    return false;
  }

  bool found = false;
  for (uint8_t channel = 11U; channel <= 26U; ++channel) {
    if (!g_radio.setChannel(channel)) {
      continue;
    }
    (void)g_radio.transmit(request, requestLength, false, 1200000UL);

    const uint32_t deadline = millis() + 70U;
    while (static_cast<int32_t>(millis() - deadline) < 0) {
      ZigbeeFrame frame{};
      if (!g_radio.receive(&frame, 4000U, 300000UL)) {
        continue;
      }

      ZigbeeMacBeaconView beacon{};
      if (!ZigbeeCodec::parseBeaconFrame(frame.psdu, frame.length, &beacon) ||
          !beacon.valid || !beacon.associationPermit) {
        continue;
      }

      if (!found || frame.rssiDbm > outResult->rssiDbm) {
        outResult->valid = true;
        outResult->channel = channel;
        outResult->rssiDbm = frame.rssiDbm;
        outResult->beacon = beacon;
        found = true;
      }
    }
  }

  if (found) {
    g_radio.setChannel(outResult->channel);
  } else {
    g_radio.setChannel(kPreferredChannel);
  }
  return found;
}

bool waitForAssociationResponse(uint16_t* outAssignedShort) {
  if (outAssignedShort == nullptr) {
    return false;
  }

  const uint32_t deadline = millis() + 1500U;
  while (static_cast<int32_t>(millis() - deadline) < 0) {
    uint8_t pollFrame[127] = {0U};
    uint8_t pollLength = 0U;
    if (!ZigbeeCodec::buildDataRequest(g_macSequence++, g_panId, g_parentShort,
                                       kIeeeAddress, pollFrame, &pollLength)) {
      return false;
    }
    (void)g_radio.transmit(pollFrame, pollLength, false, 1200000UL);

    const uint32_t listenDeadline = millis() + 90U;
    while (static_cast<int32_t>(millis() - listenDeadline) < 0) {
      ZigbeeFrame frame{};
      if (!g_radio.receive(&frame, 5000U, 350000UL)) {
        continue;
      }

      ZigbeeMacAssociationResponseView response{};
      if (!ZigbeeCodec::parseAssociationResponse(frame.psdu, frame.length,
                                                 &response) ||
          !response.valid ||
          response.destinationExtended != kIeeeAddress ||
          response.panId != g_panId || response.status != 0x00U) {
        continue;
      }

      *outAssignedShort = response.assignedShort;
      return true;
    }

    delay(25);
  }

  return false;
}

bool performJoin() {
  ScanResult result{};
  if (!activeScan(&result) || !result.valid) {
    return false;
  }

  g_channel = result.channel;
  g_panId = result.beacon.panId;
  g_parentShort = result.beacon.sourceShort;
  g_extendedPanId = result.beacon.network.extendedPanId;

  const uint8_t capabilityInformation = 0xC0U;
  uint8_t request[127] = {0U};
  uint8_t requestLength = 0U;
  if (!ZigbeeCodec::buildAssociationRequest(g_macSequence++, g_panId,
                                            g_parentShort, kIeeeAddress,
                                            capabilityInformation, request,
                                            &requestLength) ||
      !g_radio.transmit(request, requestLength, false, 1200000UL)) {
    return false;
  }

  uint16_t assignedShort = 0U;
  if (!waitForAssociationResponse(&assignedShort)) {
    return false;
  }

  g_localShort = assignedShort;
  g_joined = true;
  g_securityEnabled = false;
  configureDeviceForCurrentNetwork();
  applyJoinLed();
  persistState();
  return true;
}

void processIncomingFrame(const ZigbeeFrame& frame) {
  ZigbeeDataFrameView macData{};
  if (!ZigbeeRadio::parseDataFrameShort(frame.psdu, frame.length, &macData) ||
      !macData.valid || macData.panId != g_panId ||
      macData.destinationShort != g_localShort) {
    return;
  }

  ZigbeeNetworkFrame nwk{};
  ZigbeeNwkSecurityHeader security{};
  uint8_t decryptedPayload[127] = {0U};
  uint8_t decryptedPayloadLength = 0U;
  bool nwkValid = false;
  if (g_securityEnabled && g_haveActiveNetworkKey) {
    nwkValid = ZigbeeSecurity::parseSecuredNwkFrame(
        macData.payload, macData.payloadLength, g_activeNetworkKey, &nwk,
        &security, decryptedPayload, &decryptedPayloadLength);
    if (nwkValid &&
        (!security.valid || security.sourceIeee != kCoordinatorIeee ||
         security.keySequence != g_activeNetworkKeySequence ||
         security.frameCounter <= g_lastInboundSecurityFrameCounter)) {
      return;
    }
  }
  if (!nwkValid) {
    nwkValid =
        ZigbeeCodec::parseNwkFrame(macData.payload, macData.payloadLength, &nwk);
  }
  if (!nwkValid || !nwk.valid || nwk.destinationShort != g_localShort) {
    return;
  }
  if (security.valid) {
    g_lastInboundSecurityFrameCounter = security.frameCounter;
  }

  ZigbeeApsDataFrame aps{};
  if (!ZigbeeCodec::parseApsDataFrame(nwk.payload, nwk.payloadLength, &aps) ||
      !aps.valid) {
    (void)handleApsCommand(nwk.payload, nwk.payloadLength);
    return;
  }

  if (aps.profileId == kZigbeeProfileZdo) {
    uint16_t responseClusterId = 0U;
    uint8_t responsePayload[127] = {0U};
    uint8_t responseLength = 0U;
    if (g_device.handleZdoRequest(aps.clusterId, aps.payload, aps.payloadLength,
                                  &responseClusterId, responsePayload,
                                  &responseLength) &&
        responseLength > 0U) {
      (void)sendApsFrame(nwk.sourceShort, 0U, responseClusterId,
                         kZigbeeProfileZdo, 0U, responsePayload, responseLength);
    }
    return;
  }

  if (aps.profileId != kZigbeeProfileHomeAutomation ||
      aps.destinationEndpoint != kLocalEndpoint) {
    return;
  }

  uint8_t responseFrame[127] = {0U};
  uint8_t responseLength = 0U;
  if (!g_device.handleZclRequest(aps.clusterId, aps.payload, aps.payloadLength,
                                 responseFrame, &responseLength)) {
    return;
  }

